-- MySQL dump 10.13  Distrib 8.0.19, for macos10.15 (x86_64)
--
-- Host: localhost    Database: UWISH
-- ------------------------------------------------------
-- Server version	8.0.19

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `CityInfo`
--

DROP TABLE IF EXISTS `CityInfo`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `CityInfo` (
  `UUID` int NOT NULL AUTO_INCREMENT,
  `City` varchar(3) DEFAULT NULL,
  `District` varchar(4) DEFAULT NULL,
  PRIMARY KEY (`UUID`)
) ENGINE=InnoDB AUTO_INCREMENT=366 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `CityInfo`
--

LOCK TABLES `CityInfo` WRITE;
/*!40000 ALTER TABLE `CityInfo` DISABLE KEYS */;
INSERT INTO `CityInfo` VALUES (1,'臺北市','松山區'),(2,'臺北市','大安區'),(3,'臺北市','中正區'),(4,'臺北市','萬華區'),(5,'臺北市','大同區'),(6,'臺北市','中山區'),(7,'臺北市','文山區'),(8,'臺北市','南港區'),(9,'臺北市','內湖區'),(10,'臺北市','士林區'),(11,'臺北市','北投區'),(12,'臺北市','信義區'),(13,'臺中市','中區'),(14,'臺中市','東區'),(15,'臺中市','南區'),(16,'臺中市','西區'),(17,'臺中市','北區'),(18,'臺中市','西屯區'),(19,'臺中市','南屯區'),(20,'臺中市','北屯區'),(21,'臺中市','豐原區'),(22,'臺中市','東勢區'),(23,'臺中市','大甲區'),(24,'臺中市','清水區'),(25,'臺中市','沙鹿區'),(26,'臺中市','梧棲區'),(27,'臺中市','后里區'),(28,'臺中市','神岡區'),(29,'臺中市','潭子區'),(30,'臺中市','大雅區'),(31,'臺中市','新社區'),(32,'臺中市','石岡區'),(33,'臺中市','外埔區'),(34,'臺中市','大安區'),(35,'臺中市','烏日區'),(36,'臺中市','大肚區'),(37,'臺中市','龍井區'),(38,'臺中市','霧峰區'),(39,'臺中市','太平區'),(40,'臺中市','大里區'),(41,'臺中市','和平區'),(42,'基隆市','中正區'),(43,'基隆市','七堵區'),(44,'基隆市','暖暖區'),(45,'基隆市','仁愛區'),(46,'基隆市','中山區'),(47,'基隆市','安樂區'),(48,'基隆市','信義區'),(49,'臺南市','東區'),(50,'臺南市','南區'),(51,'臺南市','北區'),(52,'臺南市','安南區'),(53,'臺南市','安平區'),(54,'臺南市','中西區'),(55,'臺南市','新營區'),(56,'臺南市','鹽水區'),(57,'臺南市','柳營區'),(58,'臺南市','白河區'),(59,'臺南市','後壁區'),(60,'臺南市','東山區'),(61,'臺南市','麻豆區'),(62,'臺南市','下營區'),(63,'臺南市','六甲區'),(64,'臺南市','官田區'),(65,'臺南市','大內區'),(66,'臺南市','佳里區'),(67,'臺南市','西港區'),(68,'臺南市','七股區'),(69,'臺南市','將軍區'),(70,'臺南市','北門區'),(71,'臺南市','學甲區'),(72,'臺南市','新化區'),(73,'臺南市','善化區'),(74,'臺南市','新市區'),(75,'臺南市','安定區'),(76,'臺南市','山上區'),(77,'臺南市','左鎮區'),(78,'臺南市','仁德區'),(79,'臺南市','歸仁區'),(80,'臺南市','關廟區'),(81,'臺南市','龍崎區'),(82,'臺南市','玉井區'),(83,'臺南市','楠西區'),(84,'臺南市','南化區'),(85,'臺南市','永康區'),(86,'高雄市','鹽埕區'),(87,'高雄市','鼓山區'),(88,'高雄市','左營區'),(89,'高雄市','楠梓區'),(90,'高雄市','三民區'),(91,'高雄市','新興區'),(92,'高雄市','前金區'),(93,'高雄市','苓雅區'),(94,'高雄市','前鎮區'),(95,'高雄市','旗津區'),(96,'高雄市','小港區'),(97,'高雄市','鳳山區'),(98,'高雄市','林園區'),(99,'高雄市','大寮區'),(100,'高雄市','大樹區'),(101,'高雄市','大社區'),(102,'高雄市','仁武區'),(103,'高雄市','鳥松區'),(104,'高雄市','岡山區'),(105,'高雄市','橋頭區'),(106,'高雄市','燕巢區'),(107,'高雄市','田寮區'),(108,'高雄市','阿蓮區'),(109,'高雄市','路竹區'),(110,'高雄市','湖內區'),(111,'高雄市','茄萣區'),(112,'高雄市','永安區'),(113,'高雄市','彌陀區'),(114,'高雄市','梓官區'),(115,'高雄市','旗山區'),(116,'高雄市','美濃區'),(117,'高雄市','六龜區'),(118,'高雄市','甲仙區'),(119,'高雄市','杉林區'),(120,'高雄市','內門區'),(121,'高雄市','茂林區'),(122,'高雄市','桃源區'),(123,'高雄市','那瑪夏區'),(124,'新北市','新莊區'),(125,'新北市','林口區'),(126,'新北市','五股區'),(127,'新北市','蘆洲區'),(128,'新北市','三重區'),(129,'新北市','泰山區'),(130,'新北市','新店區'),(131,'新北市','石碇區'),(132,'新北市','深坑區'),(133,'新北市','坪林區'),(134,'新北市','烏來區'),(135,'新北市','板橋區'),(136,'新北市','三峽區'),(137,'新北市','鶯歌區'),(138,'新北市','樹林區'),(139,'新北市','中和區'),(140,'新北市','土城區'),(141,'新北市','瑞芳區'),(142,'新北市','平溪區'),(143,'新北市','雙溪區'),(144,'新北市','貢寮區'),(145,'新北市','金山區'),(146,'新北市','萬里區'),(147,'新北市','淡水區'),(148,'新北市','汐止區'),(149,'新北市','三芝區'),(150,'新北市','石門區'),(151,'新北市','八里區'),(152,'新北市','永和區'),(153,'宜蘭縣','宜蘭市'),(154,'宜蘭縣','頭城鎮'),(155,'宜蘭縣','礁溪鄉'),(156,'宜蘭縣','壯圍鄉'),(157,'宜蘭縣','員山鄉'),(158,'宜蘭縣','羅東鎮'),(159,'宜蘭縣','五結鄉'),(160,'宜蘭縣','冬山鄉'),(161,'宜蘭縣','蘇澳鎮'),(162,'宜蘭縣','三星鄉'),(163,'宜蘭縣','大同鄉'),(164,'宜蘭縣','南澳鄉'),(165,'桃園市','桃園區'),(166,'桃園市','大溪區'),(167,'桃園市','中壢區'),(168,'桃園市','楊梅區'),(169,'桃園市','蘆竹區'),(170,'桃園市','大園區'),(171,'桃園市','龜山區'),(172,'桃園市','八德區'),(173,'桃園市','龍潭區'),(174,'桃園市','平鎮區'),(175,'桃園市','新屋區'),(176,'桃園市','觀音區'),(177,'桃園市','復興區'),(178,'嘉義市','嘉義市'),(179,'新竹縣','竹東鎮'),(180,'新竹縣','關西鎮'),(181,'新竹縣','新埔鎮'),(182,'新竹縣','竹北市'),(183,'新竹縣','湖口鄉'),(184,'新竹縣','橫山鄉'),(185,'新竹縣','新豐鄉'),(186,'新竹縣','芎林鄉'),(187,'新竹縣','寶山鄉'),(188,'新竹縣','北埔鄉'),(189,'新竹縣','峨眉鄉'),(190,'新竹縣','尖石鄉'),(191,'新竹縣','五峰鄉'),(192,'苗栗縣','苗栗市'),(193,'苗栗縣','苑裡鎮'),(194,'苗栗縣','通霄鎮'),(195,'苗栗縣','公館鄉'),(196,'苗栗縣','銅鑼鄉'),(197,'苗栗縣','三義鄉'),(198,'苗栗縣','西湖鄉'),(199,'苗栗縣','頭屋鄉'),(200,'苗栗縣','竹南鎮'),(201,'苗栗縣','頭份市'),(202,'苗栗縣','造橋鄉'),(203,'苗栗縣','後龍鎮'),(204,'苗栗縣','三灣鄉'),(205,'苗栗縣','南庄鄉'),(206,'苗栗縣','大湖鄉'),(207,'苗栗縣','卓蘭鎮'),(208,'苗栗縣','獅潭鄉'),(209,'苗栗縣','泰安鄉'),(210,'南投縣','南投市'),(211,'南投縣','埔里鎮'),(212,'南投縣','草屯鎮'),(213,'南投縣','竹山鎮'),(214,'南投縣','集集鎮'),(215,'南投縣','名間鄉'),(216,'南投縣','鹿谷鄉'),(217,'南投縣','中寮鄉'),(218,'南投縣','魚池鄉'),(219,'南投縣','國姓鄉'),(220,'南投縣','水里鄉'),(221,'南投縣','信義鄉'),(222,'南投縣','仁愛鄉'),(223,'彰化縣','彰化市'),(224,'彰化縣','鹿港鎮'),(225,'彰化縣','和美鎮'),(226,'彰化縣','北斗鎮'),(227,'彰化縣','員林市'),(228,'彰化縣','溪湖鎮'),(229,'彰化縣','田中鎮'),(230,'彰化縣','二林鎮'),(231,'彰化縣','線西鄉'),(232,'彰化縣','伸港鄉'),(233,'彰化縣','福興鄉'),(234,'彰化縣','秀水鄉'),(235,'彰化縣','花壇鄉'),(236,'彰化縣','芬園鄉'),(237,'彰化縣','大村鄉'),(238,'彰化縣','埔鹽鄉'),(239,'彰化縣','埔心鄉'),(240,'彰化縣','永靖鄉'),(241,'彰化縣','社頭鄉'),(242,'彰化縣','二水鄉'),(243,'彰化縣','田尾鄉'),(244,'彰化縣','埤頭鄉'),(245,'彰化縣','芳苑鄉'),(246,'彰化縣','大城鄉'),(247,'彰化縣','竹塘鄉'),(248,'彰化縣','溪州鄉'),(249,'新竹市','新竹市'),(250,'雲林縣','斗六市'),(251,'雲林縣','斗南鎮'),(252,'雲林縣','虎尾鎮'),(253,'雲林縣','西螺鎮'),(254,'雲林縣','土庫鎮'),(255,'雲林縣','北港鎮'),(256,'雲林縣','古坑鄉'),(257,'雲林縣','大埤鄉'),(258,'雲林縣','莿桐鄉'),(259,'雲林縣','林內鄉'),(260,'雲林縣','二崙鄉'),(261,'雲林縣','崙背鄉'),(262,'雲林縣','麥寮鄉'),(263,'雲林縣','東勢鄉'),(264,'雲林縣','褒忠鄉'),(265,'雲林縣','台西鄉'),(266,'雲林縣','元長鄉'),(267,'雲林縣','四湖鄉'),(268,'雲林縣','口湖鄉'),(269,'雲林縣','水林鄉'),(270,'嘉義縣','朴子市'),(271,'嘉義縣','布袋鎮'),(272,'嘉義縣','大林鎮'),(273,'嘉義縣','民雄鄉'),(274,'嘉義縣','溪口鄉'),(275,'嘉義縣','新港鄉'),(276,'嘉義縣','六腳鄉'),(277,'嘉義縣','東石鄉'),(278,'嘉義縣','義竹鄉'),(279,'嘉義縣','鹿草鄉'),(280,'嘉義縣','太保市'),(281,'嘉義縣','水上鄉'),(282,'嘉義縣','中埔鄉'),(283,'嘉義縣','竹崎鄉'),(284,'嘉義縣','梅山鄉'),(285,'嘉義縣','番路鄉'),(286,'嘉義縣','大埔鄉'),(287,'嘉義縣','阿里山鄉'),(288,'屏東縣','屏東市'),(289,'屏東縣','潮州鎮'),(290,'屏東縣','東港鎮'),(291,'屏東縣','恆春鎮'),(292,'屏東縣','萬丹鄉'),(293,'屏東縣','長治鄉'),(294,'屏東縣','麟洛鄉'),(295,'屏東縣','九如鄉'),(296,'屏東縣','里港鄉'),(297,'屏東縣','鹽埔鄉'),(298,'屏東縣','高樹鄉'),(299,'屏東縣','萬巒鄉'),(300,'屏東縣','內埔鄉'),(301,'屏東縣','竹田鄉'),(302,'屏東縣','新埤鄉'),(303,'屏東縣','枋寮鄉'),(304,'屏東縣','新園鄉'),(305,'屏東縣','崁頂鄉'),(306,'屏東縣','林邊鄉'),(307,'屏東縣','南州鄉'),(308,'屏東縣','佳冬鄉'),(309,'屏東縣','琉球鄉'),(310,'屏東縣','車城鄉'),(311,'屏東縣','滿州鄉'),(312,'屏東縣','枋山鄉'),(313,'屏東縣','三地門鄉'),(314,'屏東縣','霧臺鄉'),(315,'屏東縣','瑪家鄉'),(316,'屏東縣','泰武鄉'),(317,'屏東縣','來義鄉'),(318,'屏東縣','春日鄉'),(319,'屏東縣','獅子鄉'),(320,'屏東縣','牡丹鄉'),(321,'花蓮縣','花蓮市'),(322,'花蓮縣','光復鄉'),(323,'花蓮縣','玉里鎮'),(324,'花蓮縣','新城鄉'),(325,'花蓮縣','吉安鄉'),(326,'花蓮縣','壽豐鄉'),(327,'花蓮縣','鳳林鎮'),(328,'花蓮縣','豐濱鄉'),(329,'花蓮縣','瑞穗鄉'),(330,'花蓮縣','富里鄉'),(331,'花蓮縣','秀林鄉'),(332,'花蓮縣','萬榮鄉'),(333,'花蓮縣','卓溪鄉'),(334,'臺東縣','台東市'),(335,'臺東縣','成功鎮'),(336,'臺東縣','關山鎮'),(337,'臺東縣','卑南鄉'),(338,'臺東縣','大武鄉'),(339,'臺東縣','太麻里鄉'),(340,'臺東縣','東河鄉'),(341,'臺東縣','長濱鄉'),(342,'臺東縣','鹿野鄉'),(343,'臺東縣','池上鄉'),(344,'臺東縣','綠島鄉'),(345,'臺東縣','延平鄉'),(346,'臺東縣','海端鄉'),(347,'臺東縣','達仁鄉'),(348,'臺東縣','金峰鄉'),(349,'臺東縣','蘭嶼鄉'),(350,'金門縣','金湖鎮'),(351,'金門縣','金沙鎮'),(352,'金門縣','金城鎮'),(353,'金門縣','金寧鄉'),(354,'金門縣','烈嶼鄉'),(355,'金門縣','烏坵鄉'),(356,'澎湖縣','馬公市'),(357,'澎湖縣','湖西鄉'),(358,'澎湖縣','白沙鄉'),(359,'澎湖縣','西嶼鄉'),(360,'澎湖縣','望安鄉'),(361,'澎湖縣','七美鄉'),(362,'連江縣','南竿鄉'),(363,'連江縣','北竿鄉'),(364,'連江縣','莒光鄉'),(365,'連江縣','東引鄉');
/*!40000 ALTER TABLE `CityInfo` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2020-05-05 19:43:41
